Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: warn "No hostname given";
es: warn "No se ha especificado un nombre de host";

source: warn "That doesn't look like a number";
es: warn "Esto no parece un número";

source: warn "has nondigits" if /\D/;
es: warn "contiene caracteres que no son dígitos" if /\D/;

source: warn "not a C float"
es: warn "no es flotante en C"

source: warn "not a decimal number" unless /^-?(?:\d+(?:\.\d*)?|\.\d+)$/;
es: warn "no es número decimal" unless /^-?(?:\d+(?:\.\d*)?|\.\d+)$/;

source: warn "not a decimal number" unless /^-?\d+\.?\d*$/; # rejects .2
es: warn "no es número decimal" unless /^-?\d+\.?\d*$/; # rechaza .2

source: warn "not a natural number" unless /^\d+$/; # rejects -3
es: warn "no es número natural" unless /^\d+$/; # rechaza -3

source: warn "not an integer" unless /^-?\d+$/; # rejects +3
es: warn "no es un entero" unless /^-?\d+$/; # rechaza +3

source: warn "not an integer" unless /^[+-]?\d+$/;
es: warn "no es un entero" unless /^[+-]?\d+$/;

source: we can write the more sensible (see L<Test::More> for a full explanation of is() and other testing functions).
es: podemos escribir una prueba más apropiada (en L<Test::More> encontrará una descripción completa de is() y otras funciones para realizar pruebas):

source: we prevent backtracking and find the count of the longest matching string at each matching starting point like so:
es: evitamos la vuelta atrás y hacemos el recuento de la cadena más larga coincidente en cada punto inicial de la coincidencia:

source: which is the short form of
es: que es la forma abreviada de escribir

source: which looks like your module is doing something wrong.
es: que parece indicar que su módulo ha producido un error.

source: which produces:
es: que produce:

source: which uses C<< (?>...) >> matches exactly when the one above does (verifying this yourself would be a productive exercise), but finishes in a fourth the time when used on a similar string with 1000000 C<a>s.
es: que usa C<< (?>...) >>, coincidirá exactamente con la cadena anterior (comprobar esto manualmente es un ejercicio muy interesante), pero termina en la cuarta parte de tiempo cuando se usa en una cadena similar con 1 000 000 de letras C<a>.

source: while ( ($home, $user) = (getpwent)[7,0]) {
es: while ( ($inicio, $usuario) = (getpwent)[7,0]) {

source: while ( condition ) {
es: while ( condición ) {

source: while ($string =~ /(.\G)/g) { print $1;
es: while ($cadena =~ /(.\G)/g) { print $1;

source: while (<$in>) { # assigns each line in turn to $_
es: while (<$entrada>) { # asigna una línea cada vez a $_

source: white wine
es: vino blanco

source: will match "foo" using the locale's rules for case-insensitive matching, but the C</l> does not affect how the C<\U> operates.
es: detectará "foo" basándose en las reglas de la configuración regional para la detección de coincidencias sin distinguir mayúsculas de minúsculas, pero C</l> no afecta al funcionamiento de C<\U>.

source: will match C<blah> in any case, some spaces, and an exact (I<including the case>!)
es: coincidirá con C<bla> tanto en mayúsculas como en minúsculas, con algunos espacios y una repetición exacta

source: will match, and C will be C<AB> and C will be C<B>, C will not be set.
es: coincidirá, y C será C<AB> y C será C<B>; no se establecerá el valor de C.

source: will never match, as the C<a++> will gobble up all the C<a>'s in the string and won't leave any for the remaining part of the pattern.
es: nunca coincidirá, ya que C<a++> devorará todas las letras C<a> de la cadena y no dejará ninguna para el resto del patrón.

source: will place into $count the number of digit groups found in $string.
es: pondrá en $recuento el número de grupos de dígitos que se encuentren en $cadena.

source: will set C<$res = 4>.
es: establecerá C<$res = 4>.

source: with Foreword by Larry Wall
es: con prólogo de Larry Wall

source: with an initial C, and the bytes that follow will be interpreted as
es: con C al principio, y los bytes que siguen se interpretarán como

source: with any non-default flags appearing between the caret and the colon.
es: y cualquier marca que no sea predeterminada aparece entre el signo de intercalación y el signo de dos puntos.

source: with foreword by Larry Wall
es: con prólogo de Larry Wall

source: with foreword by Randal L. Schwartz
es: con prólogo de Randal L. Schwartz

source: with invaluable help from Chris Nandor, and valuable help from Brandon Allbery, Charles Bailey, Graham Barr, Dominic Dunlop, Jarkko Hietaniemi, Ben Holzman, Tom Horsley, Nick Ing-Simmons, Tuomas J. Lukka, Laszlo Molnar, Alan Olsen, Peter Prymmer, Gurusamy Sarathy, Christoph Spalinger, Dan Sugalski, Larry Virden, and Ilya Zakharevich.
es: con la ayuda inestimable de Chris Nandor, y la valiosa ayuda de Brandon Allbery, Charles Bailey, Graham Barr, Dunlop Domingo, Hietaniemi Jarkko, Holzman Ben, Tom Horsley, Nick Ing-Simmons, J. Tuomas Lukka, Laszlo Molnar, Olsen Alan, Peter Prymmer, Gurusamy Sarathy, Spalinger Christoph, Sugalski Dan, Larry Virden y Zakharevich Ilya.

source: with the sequence C<1100> repeating again and again.
es: donde la secuencia C<1100> se repite una y otra vez.

source: world";
es: a todos";

source: would match the same as C</(Y) ( (X) \g3 \g1 )/x>.
es: coincidiría igual que con C</(Y) ( (X) \g3 \g1 )/x>.

source: would not have worked, since a pattern match in scalar context will only return true or false, rather than a count of matches.
es: no habría funcionado, ya que la detección de patrones mediante una expresión regular en contexto de escalar sólo devolverá verdadero o falso, en lugar de un recuento de coincidencias detectadas.

source: x string multiplication
es: x multiplicación de cadenas

source: you simply run this:
es: solo tiene que ejecutar esto:

source: your pattern with C (or anything else) to force Perl not to UTF-8
es: el patrón con C (o cualquier otra cosa) para evitar que Perl fuerce la codificación en UTF-8

source: {3,6} matches between 3 and 6 of the previous thing
es: {3,6} detecta entre 3 y 6 coincidencias de lo anterior

source: {3,} matches 3 or more of the previous thing
es: {3,} detecta 3 o más coincidencias de lo anterior

source: {3} matches exactly 3 of the previous thing
es: {3} detecta exactamente 3 coincidencias de lo anterior

source: {dist,ext,cpan}/**/*.{[hcyt],xs,pm} (for 5.12.0-)
es: {dist,ext,cpan}/**/*.{[hcyt],xs,pm} (para 5.12.0-)

source: {n,m} Match at least n but not more than m times
es: {n,m} Al menos n veces, pero no más de m veces

source: {n,m}+ Match at least n but not more than m times and give nothing back
es: {n,m}+ Al menos n veces, pero no más de m veces, sin devolver nada

source: {n,} Match at least n times
es: {n,} Al menos n veces

source: {n,}+ Match at least n times and give nothing back
es: {n,}+ Al menos n veces sin devolver nada

source: {n} Match exactly n times
es: {n} Exactamente n veces

source: {n}+ Match exactly n times and give nothing back (redundant)
es: {n}+ Exactamente n veces sin devolver nada (redundante)

source: {} anon.
es: {} ref. hash

source: | # or
es: | # o

source: | Alternation
es: | Alternativas

source: | ^ REGEX METACHARS REGEX MODIFIERS
es: | ^ METACARACTERES EXP. REG. MODIFICADORES EXP. REG.

# || // $ str end (bfr ) /m line based ^$
source: || // $ str end (bfr \n) /m line based ^$
es: || // $ fin cadena (antes \n) /m basado en líneas ^$

# } else { print "FAIL ";
source: } else { print "FAIL\n";
es: } else { print "ERROR\n";

source: } elsif ( other condition ) {
es: } elsif ( otra condición ) {

source: }, $class;
es: }, $clase;

source: Ãvar 5.13.10 2011-Feb-20
es: Ævar 5.13.10 2011-Feb-20

source: OK.
es: Muy bien.

source: Type
es: Escriba
